## Staging: elasticache
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.notification-canada-ca-elasticache-engine-logs`    |
|        | `aws_cloudwatch_log_group.notification-canada-ca-elasticache-slow-logs`      |
| update | `aws_elasticache_replication_group.notification-cluster-cache-multiaz-group` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notification-canada-ca-elasticache-engine-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-elasticache-engine-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/elasticache/notify-staging-cluster-cache-az/engine-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.notification-canada-ca-elasticache-slow-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-elasticache-slow-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/elasticache/notify-staging-cluster-cache-az/slow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_elasticache_replication_group.notification-cluster-cache-multiaz-group will be updated in-place
  ~ resource "aws_elasticache_replication_group" "notification-cluster-cache-multiaz-group" {
        id                            = "notify-staging-cluster-cache-az"
        tags                          = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (34 unchanged attributes hidden)


      + log_delivery_configuration {
          + destination      = "/aws/elasticache/notify-staging-cluster-cache-az/engine-logs"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
      + log_delivery_configuration {
          + destination      = "/aws/elasticache/notify-staging-cluster-cache-az/slow-logs"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }
        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_elasticache_replication_group.notification-cluster-cache-multiaz-group,
  on elasticache.tf line 21, in resource "aws_elasticache_replication_group" "notification-cluster-cache-multiaz-group":
  21:   replication_group_description = "Redis multiaz cluster with replication group"

Use description instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-engine-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-slow-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_replication_group.notification-cluster-cache-multiaz-group"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.notification-canada-ca-cache-subnet"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
